backend: tensorflow
class_name: Model
config:
  input_layers:
  - - input_1
    - 0
    - 0
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple
      - null
      - 96
      - 96
      - 3
      dtype: float32
      name: input_1
      sparse: false
    inbound_nodes: []
    name: input_1
  - class_name: Lambda
    config:
      arguments: {}
      function: !!python/tuple
      - '4wEAAAAAAAAAAQAAAAIAAABTAAAAcwwAAAB0AGoBagJ8AIMBUwApAU4pA9oCdGbaBWltYWdl2hBy

        Z2JfdG9fZ3JheXNjYWxlKQHaAWOpAHIFAAAA+h48aXB5dGhvbi1pbnB1dC0zLTc4NTU0MWE5ZTE5

        Zj7aCDxsYW1iZGE+CAAAAHMAAAAA

        '
      - null
      - null
      function_type: lambda
      name: lambda_1
      output_shape: null
      output_shape_type: raw
      trainable: true
    inbound_nodes:
    - - - input_1
        - 0
        - 0
        - {}
    name: lambda_1
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: &id002 !!python/tuple
      - 1
      - 1
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_1
      padding: same
      strides: &id003 !!python/tuple
      - 1
      - 1
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - lambda_1
        - 0
        - 0
        - {}
    name: conv2d_1
  - class_name: Activation
    config:
      activation: relu
      name: activation_1
      trainable: true
    inbound_nodes:
    - - - conv2d_1
        - 0
        - 0
        - {}
    name: activation_1
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_1
      scale: true
      trainable: true
    inbound_nodes:
    - - - activation_1
        - 0
        - 0
        - {}
    name: batch_normalization_1
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: max_pooling2d_1
      padding: valid
      pool_size: &id001 !!python/tuple
      - 3
      - 3
      strides: *id001
      trainable: true
    inbound_nodes:
    - - - batch_normalization_1
        - 0
        - 0
        - {}
    name: max_pooling2d_1
  - class_name: Dropout
    config:
      name: dropout_1
      noise_shape: null
      rate: 0.25
      seed: null
      trainable: true
    inbound_nodes:
    - - - max_pooling2d_1
        - 0
        - 0
        - {}
    name: dropout_1
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id002
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_2
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - dropout_1
        - 0
        - 0
        - {}
    name: conv2d_2
  - class_name: Activation
    config:
      activation: relu
      name: activation_2
      trainable: true
    inbound_nodes:
    - - - conv2d_2
        - 0
        - 0
        - {}
    name: activation_2
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id002
      filters: 16
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_6
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - input_1
        - 0
        - 0
        - {}
    name: conv2d_6
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_2
      scale: true
      trainable: true
    inbound_nodes:
    - - - activation_2
        - 0
        - 0
        - {}
    name: batch_normalization_2
  - class_name: Activation
    config:
      activation: relu
      name: activation_7
      trainable: true
    inbound_nodes:
    - - - conv2d_6
        - 0
        - 0
        - {}
    name: activation_7
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id002
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_3
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - batch_normalization_2
        - 0
        - 0
        - {}
    name: conv2d_3
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_7
      scale: true
      trainable: true
    inbound_nodes:
    - - - activation_7
        - 0
        - 0
        - {}
    name: batch_normalization_7
  - class_name: Activation
    config:
      activation: relu
      name: activation_3
      trainable: true
    inbound_nodes:
    - - - conv2d_3
        - 0
        - 0
        - {}
    name: activation_3
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: max_pooling2d_4
      padding: valid
      pool_size: &id004 !!python/tuple
      - 3
      - 3
      strides: *id004
      trainable: true
    inbound_nodes:
    - - - batch_normalization_7
        - 0
        - 0
        - {}
    name: max_pooling2d_4
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_3
      scale: true
      trainable: true
    inbound_nodes:
    - - - activation_3
        - 0
        - 0
        - {}
    name: batch_normalization_3
  - class_name: Dropout
    config:
      name: dropout_5
      noise_shape: null
      rate: 0.25
      seed: null
      trainable: true
    inbound_nodes:
    - - - max_pooling2d_4
        - 0
        - 0
        - {}
    name: dropout_5
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: max_pooling2d_2
      padding: valid
      pool_size: &id005 !!python/tuple
      - 2
      - 2
      strides: *id005
      trainable: true
    inbound_nodes:
    - - - batch_normalization_3
        - 0
        - 0
        - {}
    name: max_pooling2d_2
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id002
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_7
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - dropout_5
        - 0
        - 0
        - {}
    name: conv2d_7
  - class_name: Dropout
    config:
      name: dropout_2
      noise_shape: null
      rate: 0.25
      seed: null
      trainable: true
    inbound_nodes:
    - - - max_pooling2d_2
        - 0
        - 0
        - {}
    name: dropout_2
  - class_name: Activation
    config:
      activation: relu
      name: activation_8
      trainable: true
    inbound_nodes:
    - - - conv2d_7
        - 0
        - 0
        - {}
    name: activation_8
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id002
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_4
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - dropout_2
        - 0
        - 0
        - {}
    name: conv2d_4
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_8
      scale: true
      trainable: true
    inbound_nodes:
    - - - activation_8
        - 0
        - 0
        - {}
    name: batch_normalization_8
  - class_name: Activation
    config:
      activation: relu
      name: activation_4
      trainable: true
    inbound_nodes:
    - - - conv2d_4
        - 0
        - 0
        - {}
    name: activation_4
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: max_pooling2d_5
      padding: valid
      pool_size: &id006 !!python/tuple
      - 2
      - 2
      strides: *id006
      trainable: true
    inbound_nodes:
    - - - batch_normalization_8
        - 0
        - 0
        - {}
    name: max_pooling2d_5
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_4
      scale: true
      trainable: true
    inbound_nodes:
    - - - activation_4
        - 0
        - 0
        - {}
    name: batch_normalization_4
  - class_name: Dropout
    config:
      name: dropout_6
      noise_shape: null
      rate: 0.25
      seed: null
      trainable: true
    inbound_nodes:
    - - - max_pooling2d_5
        - 0
        - 0
        - {}
    name: dropout_6
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id002
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_5
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - batch_normalization_4
        - 0
        - 0
        - {}
    name: conv2d_5
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id002
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_8
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - dropout_6
        - 0
        - 0
        - {}
    name: conv2d_8
  - class_name: Activation
    config:
      activation: relu
      name: activation_5
      trainable: true
    inbound_nodes:
    - - - conv2d_5
        - 0
        - 0
        - {}
    name: activation_5
  - class_name: Activation
    config:
      activation: relu
      name: activation_9
      trainable: true
    inbound_nodes:
    - - - conv2d_8
        - 0
        - 0
        - {}
    name: activation_9
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_5
      scale: true
      trainable: true
    inbound_nodes:
    - - - activation_5
        - 0
        - 0
        - {}
    name: batch_normalization_5
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_9
      scale: true
      trainable: true
    inbound_nodes:
    - - - activation_9
        - 0
        - 0
        - {}
    name: batch_normalization_9
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: max_pooling2d_3
      padding: valid
      pool_size: &id007 !!python/tuple
      - 2
      - 2
      strides: *id007
      trainable: true
    inbound_nodes:
    - - - batch_normalization_5
        - 0
        - 0
        - {}
    name: max_pooling2d_3
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: max_pooling2d_6
      padding: valid
      pool_size: &id008 !!python/tuple
      - 2
      - 2
      strides: *id008
      trainable: true
    inbound_nodes:
    - - - batch_normalization_9
        - 0
        - 0
        - {}
    name: max_pooling2d_6
  - class_name: Dropout
    config:
      name: dropout_3
      noise_shape: null
      rate: 0.25
      seed: null
      trainable: true
    inbound_nodes:
    - - - max_pooling2d_3
        - 0
        - 0
        - {}
    name: dropout_3
  - class_name: Dropout
    config:
      name: dropout_7
      noise_shape: null
      rate: 0.25
      seed: null
      trainable: true
    inbound_nodes:
    - - - max_pooling2d_6
        - 0
        - 0
        - {}
    name: dropout_7
  - class_name: Flatten
    config:
      data_format: channels_last
      name: flatten_1
      trainable: true
    inbound_nodes:
    - - - dropout_3
        - 0
        - 0
        - {}
    name: flatten_1
  - class_name: Flatten
    config:
      data_format: channels_last
      name: flatten_2
      trainable: true
    inbound_nodes:
    - - - dropout_7
        - 0
        - 0
        - {}
    name: flatten_2
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      name: dense_1
      trainable: true
      units: 256
      use_bias: true
    inbound_nodes:
    - - - flatten_1
        - 0
        - 0
        - {}
    name: dense_1
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      name: dense_3
      trainable: true
      units: 128
      use_bias: true
    inbound_nodes:
    - - - flatten_2
        - 0
        - 0
        - {}
    name: dense_3
  - class_name: Activation
    config:
      activation: relu
      name: activation_6
      trainable: true
    inbound_nodes:
    - - - dense_1
        - 0
        - 0
        - {}
    name: activation_6
  - class_name: Activation
    config:
      activation: relu
      name: activation_10
      trainable: true
    inbound_nodes:
    - - - dense_3
        - 0
        - 0
        - {}
    name: activation_10
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_6
      scale: true
      trainable: true
    inbound_nodes:
    - - - activation_6
        - 0
        - 0
        - {}
    name: batch_normalization_6
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_10
      scale: true
      trainable: true
    inbound_nodes:
    - - - activation_10
        - 0
        - 0
        - {}
    name: batch_normalization_10
  - class_name: Dropout
    config:
      name: dropout_4
      noise_shape: null
      rate: 0.5
      seed: null
      trainable: true
    inbound_nodes:
    - - - batch_normalization_6
        - 0
        - 0
        - {}
    name: dropout_4
  - class_name: Dropout
    config:
      name: dropout_8
      noise_shape: null
      rate: 0.5
      seed: null
      trainable: true
    inbound_nodes:
    - - - batch_normalization_10
        - 0
        - 0
        - {}
    name: dropout_8
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      name: dense_2
      trainable: true
      units: 4
      use_bias: true
    inbound_nodes:
    - - - dropout_4
        - 0
        - 0
        - {}
    name: dense_2
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      name: dense_4
      trainable: true
      units: 3
      use_bias: true
    inbound_nodes:
    - - - dropout_8
        - 0
        - 0
        - {}
    name: dense_4
  - class_name: Activation
    config:
      activation: softmax
      name: category_output
      trainable: true
    inbound_nodes:
    - - - dense_2
        - 0
        - 0
        - {}
    name: category_output
  - class_name: Activation
    config:
      activation: softmax
      name: color_output
      trainable: true
    inbound_nodes:
    - - - dense_4
        - 0
        - 0
        - {}
    name: color_output
  name: fashionnet
  output_layers:
  - - category_output
    - 0
    - 0
  - - color_output
    - 0
    - 0
keras_version: 2.2.4
